FKDD_COPY_DIFF_3_2026-02-13/Documents/ПлановыеЗначенияKPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПлановыеЗначенияKPI</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПлановыеЗначенияKPI</xr:Item>
				<xr:Item>InformationRegister.ДатыЗапретаРедактированияНачислений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторПоследнегоИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретРедактирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийОбъект</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Должности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииДолжностейСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыKPIДляРасчетаПлана</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>KPI</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.KPI</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>План</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииДолжностейСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПланыБЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазоваяЧасть</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.KPI</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>План</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СвязанныйПараметрKPI</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПараметрыНастройкиKPI</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииДолжностейСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/СоставKPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоставKPI</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>KPI</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.KPI</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииДолжностейСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/ЦелевыеПоказатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦелевыеПоказатели</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БазоваяЧасть</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.KPI</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииДолжностейСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/ПараметрыKPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПараметрыKPI</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПороговоеЗначение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоэффициентПремирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтавкаЗа1шт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетныйПараметр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Плановый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ПараметрыНастройкиKPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПараметрыНастройкиKPI</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПараметра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПараметрыKPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийОбъект</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Documents/ПлановыеЗначенияKPI/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если ЗапретРедактированияВДЦ и НЕ ЭтоБазаКонсОтч и НЕ (РольДоступна("АдминистраторСистемыKPI") и обПраво("ФЭС")) Тогда
	//	ЭтаФорма.ТолькоПросмотр=Истина;
	//КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Автор = ПараметрыСеанса.Пользователь;
		Объект.Периодичность=Перечисления.Периодичность.Месяц;
		Объект.ПериодПланирования=НачалоМесяца(ТекущаяДата());
		Объект.ПодразделениеКомпании=Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
		Объект.Организация=Справочники.Организации.ОсновнаяОрганизация;
	КонецЕсли;	

	СписокЗначения=Новый Массив;
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Месяц"));
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"));
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Год"));
	
	Элементы.Периодичность.СписокВыбора.ЗагрузитьЗначения(СписокЗначения);
	
	Модифицированность = Ложь;
	
	ПроверитьОтображениеКолонкиКатегория(); 

	Мотивация.ПроверитьДоступностьОбъектаПоДатеЗапрета(Объект, ЭтаФорма,Объект.ПериодПланирования,Объект.Организация,Объект.ПодразделениеКомпании);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПереодичностьПриИзменении(Элементы.Периодичность);

КонецПроцедуры

&НаСервере
Процедура ПроверитьОтображениеКолонкиКатегория()
	
	мЕстьДанныеДляКолонки = Ложь;
	
	Для каждого СтрДолжности из Объект.Должности Цикл
		Если ТипЗнч(СтрДолжности.Должность) = Тип("СправочникСсылка.Должности") Тогда 
			Если СтрДолжности.Должность.КатегорийнаяДолжность Тогда
				мЕстьДанныеДляКолонки = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.Должности.ПодчиненныеЭлементы.ДолжностиКатегория.Видимость = мЕстьДанныеДляКолонки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПроверитьЗаполненностьКолонкиКатегория(Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполненностьКолонкиКатегория(Отказ)
	
	Для каждого СтрДолжности из Объект.Должности Цикл
		Если ТипЗнч(СтрДолжности.Должность) = Тип("СправочникСсылка.Должности") Тогда 
			Если СтрДолжности.Должность.КатегорийнаяДолжность 
				И СтрДолжности.Категория = Справочники.КатегорииДолжностейСотрудников.ПустаяСсылка() Тогда
				Отказ = Истина;
				Сообщить("Для должности: " + СтрДолжности.Должность + "; в строке: " + СтрДолжности.НомерСтроки + ", не заполнена категория, запись отменена!" ,СтатусСообщения.ОченьВажное);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереодичностьПриИзменении(Элемент)
	
	Если Объект.Периодичность=Перечисления.Периодичность.Месяц Тогда
		
		ДатаПланирования = Мотивация.ДатаКакМесяцПредставление(Объект.ПериодПланирования);
		
	ИначеЕсли Объект.Периодичность=Перечисления.Периодичность.Год Тогда
		
		Объект.ПериодПланирования=НачалоМесяца(КонецГода(Объект.ПериодПланирования));
		ДатаПланирования=Формат(Год(Объект.ПериодПланирования),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
		
	ИначеЕсли Объект.Периодичность=Перечисления.Периодичность.Квартал Тогда
		
		Объект.ПериодПланирования=НачалоМесяца(КонецКвартала(Объект.ПериодПланирования));
		ДатаПланирования=Формат(Объект.ПериодПланирования,"ДФ='q КВ.  yyyy'; ДЛФ=");
		
	ИначеЕсли ПустаяСтрока(Объект.Периодичность) Тогда
		
		ДатаПланирования = Мотивация.ДатаКакМесяцПредставление(Объект.ПериодПланирования);
		
	Иначе
		
		Сообщить("Неверная периодичность!");
		Объект.Периодичность="";
		ДатаПланирования = Мотивация.ДатаКакМесяцПредставление(Объект.ПериодПланирования);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка=Ложь;
	СписокЗначения=Новый СписокЗначений;
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Месяц"));
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"));
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Год"));
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПериодичностьНачалоВыбораЗавершение", ЭтотОбъект), СписокЗначения, Элементы.Периодичность);

КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если НЕ ВыбранныйЭлемент = Неопределено Тогда 
		
		Объект.Периодичность= ВыбранныйЭлемент.Значение;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПериодПланированияПриИзменении(Элемент)
	
	Если Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		
	    Мотивация.ДатаКакМесяцПодобратьДатуПоТексту(ДатаПланирования, Объект.ПериодПланирования);
		ДатаПланирования = Мотивация.ДатаКакМесяцПредставление(Объект.ПериодПланирования);

	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПериодПланированияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		
		НачалоВыбораИзСпискаПредставленияПериодаРегистрации(ДатаПланирования, СтандартнаяОбработка, Объект.ПериодПланирования);
		
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		
		Если Объект.ПериодПланирования<Дата("01.01.2000 00:00:00") Тогда
			НачГод=Формат(Год(ТекущаяДата())-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			КонГод=Формат(Год(ТекущаяДата())+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			ТекГод=Формат(Год(ТекущаяДата()),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
		Иначе
			НачГод=Формат(Год(Объект.ПериодПланирования)-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			КонГод=Формат(Год(Объект.ПериодПланирования)+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			ТекГод=Формат(Год(Объект.ПериодПланирования),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
		КонецЕсли;
		
		НеВыбран=истина;
		Пока НеВыбран Цикл
			
			СпКварталов=Новый СписокЗначений;
			СпКварталов.Добавить("... "+НачГод);
			
			Для Сч=1 по 4 Цикл
				СпКварталов.Добавить(Формат(Сч,"ЧЦ=1; ЧРД=; ЧРГ=; ЧГ=")+" КВ."+ТекГод);
			КонецЦикла;
			
			СпКварталов.Добавить("... "+КонГод);
			Эл=ВыбратьИзМеню(СпКварталов,Элемент);
			Если Не ПустаяСтрока(Эл) Тогда
				Если Найти(Эл.Значение,НачГод) Тогда
					НачГод=Формат(Число(НачГод)-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					ТекГод=Формат(Число(НачГод),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					КонГод=Формат(Число(НачГод)+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					Продолжить;
				КонецЕсли;
				
				Если Найти(Эл.Значение,КонГод) Тогда
					НачГод=Формат(Число(КонГод)-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					ТекГод=Формат(Число(КонГод),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					КонГод=Формат(Число(КонГод)+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					Продолжить;
				КонецЕсли;
				
				НеВыбран=ложь;
				ДатаПланирования=Эл.Значение;
				Объект.ПериодПланирования=Дата(Число(ТекГод),Число(Лев(Эл.Значение,1))*3-2,1);
				Объект.ПериодПланирования=НачалоМесяца(КонецКвартала(Объект.ПериодПланирования));
			Иначе
				НеВыбран=ложь;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		
		Если Объект.ПериодПланирования<Дата("01.01.2000 00:00:00") Тогда
			НачГод=Год(ТекущаяДата())-3;
			КонГод=Год(ТекущаяДата())+3;
		Иначе
			НачГод=Год(Объект.ПериодПланирования)-3;
			КонГод=Год(Объект.ПериодПланирования)+3;
		КонецЕсли;
		
		СпГодов=Новый СписокЗначений;
		Для Сч=НачГод по КонГод Цикл
			СпГодов.Добавить(Формат(Сч,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ="));
		КонецЦикла;
		
		Эл=ВыбратьИзМеню(СпГодов,Элемент);
		
		Если Не ПустаяСтрока(Эл) Тогда
			ДатаПланирования=Эл.Значение;
			Объект.ПериодПланирования=Дата("01.01."+ДатаПланирования+" 00:00:00");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПланированияНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	Если Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		
		НачалоВыбораИзСпискаПредставленияПериодаРегистрации(ДатаПланирования, СтандартнаяОбработка, Объект.ПериодПланирования);
		
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		
		Если Объект.ПериодПланирования<Дата("01.01.2000 00:00:00") Тогда
			НачГод=Формат(Год(ТекущаяДата())-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			КонГод=Формат(Год(ТекущаяДата())+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			ТекГод=Формат(Год(ТекущаяДата()),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
		Иначе
			НачГод=Формат(Год(Объект.ПериодПланирования)-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			КонГод=Формат(Год(Объект.ПериодПланирования)+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			ТекГод=Формат(Год(Объект.ПериодПланирования),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
		КонецЕсли;
		
		НеВыбран=истина;
		Пока НеВыбран Цикл
			
			СпКварталов=Новый СписокЗначений;
			СпКварталов.Добавить("... "+НачГод);
			
			Для Сч=1 по 4 Цикл
				СпКварталов.Добавить(Формат(Сч,"ЧЦ=1; ЧРД=; ЧРГ=; ЧГ=")+" КВ."+ТекГод);
			КонецЦикла;
			
			СпКварталов.Добавить("... "+КонГод);
			Эл=ВыбратьИзМеню(СпКварталов,Элемент);
			Если Не ПустаяСтрока(Эл) Тогда
				Если Найти(Эл.Значение,НачГод) Тогда
					НачГод=Формат(Число(НачГод)-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					ТекГод=Формат(Число(НачГод),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					КонГод=Формат(Число(НачГод)+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					Продолжить;
				КонецЕсли;
				
				Если Найти(Эл.Значение,КонГод) Тогда
					НачГод=Формат(Число(КонГод)-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					ТекГод=Формат(Число(КонГод),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					КонГод=Формат(Число(КонГод)+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					Продолжить;
				КонецЕсли;
				
				НеВыбран=ложь;
				ДатаПланирования=Эл.Значение;
				Объект.ПериодПланирования=Дата(Число(ТекГод),Число(Лев(Эл.Значение,1))*3-2,1);
				Объект.ПериодПланирования=НачалоМесяца(КонецКвартала(Объект.ПериодПланирования));
			Иначе
				НеВыбран=ложь;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		
		Если Объект.ПериодПланирования<Дата("01.01.2000 00:00:00") Тогда
			НачГод=Год(ТекущаяДата())-3;
			КонГод=Год(ТекущаяДата())+3;
		Иначе
			НачГод=Год(Объект.ПериодПланирования)-3;
			КонГод=Год(Объект.ПериодПланирования)+3;
		КонецЕсли;
		
		СпГодов=Новый СписокЗначений;
		Для Сч=НачГод по КонГод Цикл
			СпГодов.Добавить(Формат(Сч,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ="));
		КонецЦикла;
		
		Эл=ВыбратьИзМеню(СпГодов,Элемент);
		
		Если Не ПустаяСтрока(Эл) Тогда
			ДатаПланирования=Эл.Значение;
			Объект.ПериодПланирования=Дата("01.01."+ДатаПланирования+" 00:00:00");
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПериодПланированияРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Если Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		
		Объект.ПериодПланирования = ДобавитьМесяц(Объект.ПериодПланирования, Направление);
		ДатаПланирования = Мотивация.ДатаКакМесяцПредставление(Объект.ПериодПланирования);

	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		
		Если Направление>0 Тогда
			Объект.ПериодПланирования=ДобавитьМесяц(Объект.ПериодПланирования,3);
		Иначе
			Объект.ПериодПланирования=ДобавитьМесяц(Объект.ПериодПланирования,-3);
		КонецЕсли;
		
		ДатаПланирования = Формат(Объект.ПериодПланирования,"ДФ='q КВ.  yyyy'; ДЛФ=");
		
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		
		Если Направление>0 Тогда
			Объект.ПериодПланирования=ДобавитьМесяц(Объект.ПериодПланирования,12);
		Иначе
			Объект.ПериодПланирования=ДобавитьМесяц(Объект.ПериодПланирования,-12);
		КонецЕсли;
		
		ДатаПланирования=Формат(Год(Объект.ПериодПланирования),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДолжностиДолжностьПриИзменении(Элемент)
	
	Если Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		
		НачПериода=НачалоМесяца(Объект.ПериодПланирования);
		КонПериода=КонецМесяца(Объект.ПериодПланирования);
		
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		
		НачПериода=НачалоКвартала(Объект.ПериодПланирования);
		КонПериода=КонецКвартала(Объект.ПериодПланирования);
		
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		
		НачПериода=НачалоГода(Объект.ПериодПланирования);
		КонПериода=КонецГода(Объект.ПериодПланирования);
		
	Иначе
		
		Сообщить("Неверная периодичность");
		
		Возврат;
		
	КонецЕсли;
	
	МС = Объект.НаборыKPIДляРасчетаПлана.НайтиСтроки(Новый Структура("Должность,Категория",ТекущаяДолжность,ТекущаяКатегория));
	Для Каждого Эл из МС Цикл
		Объект.НаборыKPIДляРасчетаПлана.Удалить(Эл);
	КонецЦикла;
	
	МС = Объект.ПланыБЧ.НайтиСтроки(Новый Структура("Должность,Категория",ТекущаяДолжность,ТекущаяКатегория));
	Для Каждого Эл из МС Цикл
		Объект.ПланыБЧ.Удалить(Эл);
	КонецЦикла;
	
	Элементы.Должности.ТекущиеДанные.Категория = Справочники.КатегорииДолжностейСотрудников.ПустаяСсылка();
		
	ЗаполнитьДляДолжности(ТекущаяДолжность, КонПериода, ТекущаяКатегория);
	
	ДолжностиПриАктивизацииСтроки(Элемент);
	
	ПроверитьОтображениеКолонкиКатегория(); 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДляДолжности(Должность, КонПериода, мТекКат=Неопределено) Экспорт
	
	Если мТекКат = Неопределено Тогда
		мТекКат = Справочники.КатегорииДолжностейСотрудников.ПустаяСсылка();
	КонецЕсли;
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	СоставKPI.Должность,
	|	СоставKPI.Категория,
	|	СоставKPI.KPI,
	|	СоставKPI.Вес,
	|	СоставKPI.Период КАК Период
	|ИЗ
	|	РегистрСведений.СоставKPI.СрезПоследних(&Дата, ) КАК СоставKPI
	|ГДЕ
	|	СоставKPI.Должность = &Должность
	|	И СоставKPI.Категория = &Категория
	|	И СоставKPI.Периодичность = &Периодичность
	|	И СоставKPI.ПодразделениеКомпании = &ПодразделениеКомпании
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ");
	Запрос.УстановитьПараметр("Должность", Должность);
	Запрос.УстановитьПараметр("Категория", мТекКат);
	Запрос.УстановитьПараметр("Дата", КонПериода);
	Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
	
	Выб=Запрос.Выполнить().Выбрать();
	
	Если Выб.Следующий() Тогда
		ПослПериод=Выб.Период;
	КонецЕсли;
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	СоставKPI.Должность,
	|	СоставKPI.Категория,
	|	СоставKPI.KPI,
	|	СоставKPI.Вес,
	|	СоставKPI.Период
	|ИЗ
	|	РегистрСведений.СоставKPI.СрезПоследних(&Дата, ) КАК СоставKPI
	|ГДЕ
	|	СоставKPI.Должность = &Должность
	|	И СоставKPI.Категория = &Категория
	|	И СоставKPI.Периодичность = &Периодичность
	|	И СоставKPI.Период = &Период
	|	И СоставKPI.ПодразделениеКомпании = &ПодразделениеКомпании
	|	И НЕ СоставKPI.KPI.НетПлана
	|
	|УПОРЯДОЧИТЬ ПО
	|	СоставKPI.Период УБЫВ");
	
	Запрос.УстановитьПараметр("Должность", Должность);
	Запрос.УстановитьПараметр("Категория", мТекКат);
	Запрос.УстановитьПараметр("Дата", КонПериода);
	Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
	Запрос.УстановитьПараметр("Период", ПослПериод);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		
		Нов=Объект.НаборыKPIДляРасчетаПлана.Добавить();
		Нов.KPI = Результат.KPI;
		Нов.Должность = Результат.Должность;
		Нов.Категория = Результат.Категория;
		
	КонецЦикла;
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	ЦелевыеПоказателиСрезПоследних.Период КАК Период,
	|	ЦелевыеПоказателиСрезПоследних.Должность,
	|	ЦелевыеПоказателиСрезПоследних.Категория,
	|	ЦелевыеПоказателиСрезПоследних.Периодичность,
	|	ЦелевыеПоказателиСрезПоследних.БазоваяЧасть
	|ИЗ
	|	РегистрСведений.ЦелевыеПоказатели.СрезПоследних(&Дата, ) КАК ЦелевыеПоказателиСрезПоследних
	|ГДЕ
	|	ЦелевыеПоказателиСрезПоследних.Должность = &Должность
	|	И ЦелевыеПоказателиСрезПоследних.Категория = &Категория
	|	И ЦелевыеПоказателиСрезПоследних.Периодичность = &Периодичность
	|	И ЦелевыеПоказателиСрезПоследних.ПодразделениеКомпании = &ПодразделениеКомпании
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ");
	
	Запрос.УстановитьПараметр("Должность", Должность);
	Запрос.УстановитьПараметр("Категория", мТекКат);
	Запрос.УстановитьПараметр("Дата", КонПериода);
	Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);	
	
	Выб=Запрос.Выполнить().Выбрать();
	
	ПослПериод=Дата("01.01.01 00:00:00");
	
	Выб=Запрос.Выполнить().Выбрать();
	
	Если Выб.Следующий() Тогда
		
		ПослПериод=Выб.Период;
		
	КонецЕсли;
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	ЦелевыеПоказателиСрезПоследних.Период КАК Период,
	|	ЦелевыеПоказателиСрезПоследних.Должность,
	|	ЦелевыеПоказателиСрезПоследних.Категория,
	|	ЦелевыеПоказателиСрезПоследних.Периодичность,
	|	ЦелевыеПоказателиСрезПоследних.БазоваяЧасть
	|ИЗ
	|	РегистрСведений.ЦелевыеПоказатели.СрезПоследних(&Дата, ) КАК ЦелевыеПоказателиСрезПоследних
	|ГДЕ
	|	ЦелевыеПоказателиСрезПоследних.Должность = &Должность
	|	И ЦелевыеПоказателиСрезПоследних.Категория = &Категория
	|	И ЦелевыеПоказателиСрезПоследних.Периодичность = &Периодичность
	|	И ЦелевыеПоказателиСрезПоследних.Период = &Период
	|	И ЦелевыеПоказателиСрезПоследних.ПодразделениеКомпании = &ПодразделениеКомпании
	|	И НЕ ЦелевыеПоказателиСрезПоследних.БазоваяЧасть.НетПлана
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ");
	
	Запрос.УстановитьПараметр("Должность", Должность);
	Запрос.УстановитьПараметр("Категория", мТекКат);
	Запрос.УстановитьПараметр("Дата", КонПериода);
	Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
	Запрос.УстановитьПараметр("Период", ПослПериод);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);	
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		
		Если ТипЗнч(Результат.БазоваяЧасть) = ТипЗнч(Справочники.KPI.ПустаяСсылка()) Тогда
			
			Нов=Объект.ПланыБЧ.Добавить();
			Нов.БазоваяЧасть = Результат.БазоваяЧасть;
			Нов.Должность = Должность;
			Нов.Категория = мТекКат;
			Нов.СвязанныйПараметрKPI = УзнатьПараметр(Результат.БазоваяЧасть);
			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция УзнатьПараметр(БЧ)
	
	Если ТипЗнч(БЧ)=ТипЗнч(1) Тогда
		Возврат неопределено;
	Иначе
		Запрос=Новый Запрос("ВЫБРАТЬ
		|	KPIПоказателиДляРасчета.Ссылка,
		|	KPIПоказателиДляРасчета.Показатель
		|ИЗ
		|	Справочник.KPI.ПоказателиДляРасчета КАК KPIПоказателиДляРасчета
		|ГДЕ
		|	KPIПоказателиДляРасчета.Ссылка = &Ссылка
		|	И KPIПоказателиДляРасчета.Показатель ССЫЛКА Справочник.ПараметрыНастройкиKPI
		|	И KPIПоказателиДляРасчета.Показатель.ВидПараметра = &ВидПараметра");
		
		Запрос.УстановитьПараметр("Ссылка",БЧ);
		Запрос.УстановитьПараметр("Видпараметра", Перечисления.ПараметрыKPI.Плановый);
		
		Выб=Запрос.Выполнить().Выбрать();
		
		Если Выб.Следующий() Тогда
			Возврат Выб.Показатель;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ДолжностиКатегорияПриИзменении(Элемент)
	
	Если Объект.Периодичность=ПредопределенноеЗначение(".Периодичность.Месяц") Тогда
		
		НачПериода = НачалоМесяца(Объект.ПериодПланирования);
		КонПериода = КонецМесяца(Объект.ПериодПланирования);
		
	ИначеЕсли Объект.Периодичность = ПредопределенноеЗначение(".Периодичность.Квартал") Тогда
		
		НачПериода = НачалоКвартала(Объект.ПериодПланирования);
		КонПериода = КонецКвартала(Объект.ПериодПланирования);
		
	ИначеЕсли Объект.Периодичность = ПредопределенноеЗначение(".Периодичность.Год") Тогда
		
		НачПериода = НачалоГода(Объект.ПериодПланирования);
		КонПериода = КонецГода(Объект.ПериодПланирования);
		
	Иначе
		
		Сообщить("Неверная периодичность");
		
		Возврат;
		
	КонецЕсли;
	
	МС = Объект.НаборыKPIДляРасчетаПлана.НайтиСтроки(Новый Структура("Должность,Категория",ТекущаяДолжность,ТекущаяКатегория));
	Для Каждого Эл из МС Цикл
		Объект.НаборыKPIДляРасчетаПлана.Удалить(Эл);
	КонецЦикла;
	
	МС = Объект.ПланыБЧ.НайтиСтроки(Новый Структура("Должность,Категория", ТекущаяДолжность, ТекущаяКатегория));
	Для Каждого Эл из МС Цикл
		Объект.ПланыБЧ.Удалить(Эл);
	КонецЦикла;
	
	ЗаполнитьДляДолжности(ТекущаяДолжность, КонПериода, ТекущаяКатегория);
	
	ДолжностиПриАктивизацииСтроки(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ДолжностиКатегорияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Элементы.Должности.ТекущиеДанные<>Неопределено Тогда
		
		ТекущаяКатегория = Элементы.Должности.ТекущиеДанные.Категория;
		ТекущаяДолжность = Элементы.Должности.ТекущиеДанные.Должность;
		
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("КатегорийнаяДолжность", ТекущаяДолжность);
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("Отбор",ПараметрыОтбора);
	ПараметрыВыбора.Вставить("РежимВыбора",Истина);
	
	ОткрытьФорму("Справочник.КатегорииДолжностейСотрудников.ФормаВыбора",ПараметрыВыбора,Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ДолжностиПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Должности.ТекущиеДанные<>Неопределено Тогда
		
		ТекущаяСтрока = Элементы.Должности.ТекущиеДанные;
		
		ТекущаяДолжность = ТекущаяСтрока.Должность;
		ТекущаяКатегория = ТекущаяСтрока.Категория;
		
		Если НЕ ТекущаяДолжность = Справочники.Должности.ПустаяСсылка() Тогда
			
			КлючОтбора = Новый ФиксированнаяСтруктура("Должность", ТекущаяДолжность);
			
			Элементы.НаборыKPIДляРасчетаПлана.ОтборСтрок = КлючОтбора;
			
			Элементы.ПланыБЧ.ОтборСтрок = КлючОтбора;
			
		КонецЕсли;
		
		Если НЕ ТекущаяКатегория = Справочники.КатегорииДолжностейСотрудников.ПустаяСсылка() Тогда
			
			КлючОтбораКатегория = Новый ФиксированнаяСтруктура("Категория", ТекущаяКатегория);
			
			Элементы.НаборыKPIДляРасчетаПлана.ОтборСтрок = КлючОтбораКатегория;
			Элементы.ПланыБЧ.ОтборСтрок = КлючОтбораКатегория;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДолжностиПередУдалением(Элемент, Отказ)
	
	Если Элементы.Должности.ТекущаяСтрока<>Неопределено Тогда
		
		ТекущаяСтрока = Элементы.Должности.ТекущиеДанные;
		
		ТекущаяДолжность = ТекущаяСтрока.Должность;
		ТекущаяКатегория = ТекущаяСтрока.Категория;
		
	КонецЕсли;
	
	МС = Объект.НаборыKPIДляРасчетаПлана.НайтиСтроки(Новый Структура("Должность,Категория",ТекущаяДолжность,ТекущаяКатегория));
	Для Каждого Эл из МС Цикл
		Объект.НаборыKPIДляРасчетаПлана.Удалить(Эл);
	КонецЦикла;
	
	МС = Объект.ПланыБЧ.НайтиСтроки(Новый Структура("Должность,Категория",ТекущаяДолжность,ТекущаяКатегория));
	Для Каждого Эл из МС Цикл
		Объект.ПланыБЧ.Удалить(Эл);
	КонецЦикла;

КонецПроцедуры


&НаСервере
Процедура  ЗаполнитьПланыБЧНасервере()
	
	Запрос =  Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПремиальныеФондыСрезПоследних.Должность КАК Должность,
	|	ПремиальныеФондыСрезПоследних.БазоваяЧасть КАК БазоваяЧасть
	|ИЗ
	|	РегистрСведений.ЦелевыеПоказатели.СрезПоследних(
	|			&ДатаДок,
	|			ПодразделениеКомпании = &Подразделение
	|				И Периодичность = &Периодичность) КАК ПремиальныеФондыСрезПоследних";
	Запрос.УстановитьПараметр("ДатаДок",       Объект.Дата);
	Запрос.УстановитьПараметр("Подразделение", Объект.ПодразделениеКомпании);
    Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);

	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		СтрНовая = Объект.ПланыБЧ.Добавить();
		ЗаполнитьЗначенияСвойств(СтрНовая, Результат);
	КонецЦикла;

КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьДолжности(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Организация) тогда
		Мотивация.СообщитьПользователю("Не заполнена организация", "Организация");
		Возврат;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ПодразделениеКомпании) тогда
		Мотивация.СообщитьПользователю("Не заполнено подразделение", "ПодразделениеКомпании");
		Возврат;	
	КонецЕсли;	
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьДолжностиЗавершение", ЭтотОбъект), "Перезаполнить таблицу должностей? Все данные будут очищены",РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДолжностиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		ЗаполнитьДолжностиНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДолжностиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоставKPIСрезПоследних.Должность КАК Должность
		|ИЗ
		|	РегистрСведений.СоставKPI.СрезПоследних(&НаДату, ПодразделениеКомпании = &ПодразделениеКомпании) КАК СоставKPIСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	СоставKPIСрезПоследних.Должность
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЦелевыеПоказателиСрезПоследних.Должность
		|ИЗ
		|	РегистрСведений.ЦелевыеПоказатели.СрезПоследних(&НаДату, ПодразделениеКомпании = &ПодразделениеКомпании) КАК ЦелевыеПоказателиСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦелевыеПоказателиСрезПоследних.Должность";
	
	Запрос.УстановитьПараметр("НаДату", КонецМесяца(Объект.ПериодПланирования));
	Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Должность", ВыборкаДетальныеЗаписи.Должность);
		
		НС = Объект.Должности.НайтиСтроки(ПараметрыОтбора);
		Если НС.Количество() = 0 Тогда
			
			Если ЕстьНабор(ВыборкаДетальныеЗаписи.Должность) Тогда
				
				НоваяСтрока = Объект.Должности.Добавить();
				НоваяСтрока.Должность = ВыборкаДетальныеЗаписи.Должность;
				
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаборыKPI(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ПодразделениеКомпании) тогда
		Мотивация.СообщитьПользователю("Не заполнено подразделение", "ПодразделениеКомпании");
		Возврат;	
	КонецЕсли;	
	
	Вопрос="Все планы будут перезаполнены. Продолжить?";
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьНаборыKPIЗавершение", ЭтотОбъект), Вопрос, РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаборыKPIЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		
		ЗаполнитьНаборыKPIНаСервере();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаборыKPIНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоставKPIСрезПоследних.Должность КАК Должность
		|ИЗ
		|	РегистрСведений.СоставKPI.СрезПоследних(&НаДату, ПодразделениеКомпании = &ПодразделениеКомпании) КАК СоставKPIСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	СоставKPIСрезПоследних.Должность
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЦелевыеПоказателиСрезПоследних.Должность
		|ИЗ
		|	РегистрСведений.ЦелевыеПоказатели.СрезПоследних(&НаДату, ПодразделениеКомпании = &ПодразделениеКомпании) КАК ЦелевыеПоказателиСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦелевыеПоказателиСрезПоследних.Должность";
	
	Запрос.УстановитьПараметр("НаДату", КонецМесяца(Объект.ПериодПланирования));
	Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПараметрыОтбор = Новый Структура;
		ПараметрыОтбор.Вставить("Должность", ВыборкаДетальныеЗаписи.Должность);
		
		НС = Объект.Должности.НайтиСтроки(ПараметрыОтбор);
		Если НС.Количество() = 0 Тогда
			
			Если ЕстьНабор(ВыборкаДетальныеЗаписи.Должность) Тогда
				
				НоваяСтрока = Объект.Должности.Добавить();
				НоваяСтрока.Должность = ВыборкаДетальныеЗаписи.Должность;
				
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;
		
	ОбновитьЗаполнение();		

КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаполнение() Экспорт
	
	Было = Объект.НаборыKPIДляРасчетаПлана.Выгрузить();
	
	БылоБЧ = Объект.ПланыБЧ.Выгрузить();
	
	Объект.НаборыKPIДляРасчетаПлана.Очистить();
	
	Объект.ПланыБЧ.Очистить();
	
	Если Объект.Периодичность=Перечисления.Периодичность.Месяц Тогда
		НачПериода=НачалоМесяца(Объект.ПериодПланирования);
		КонПериода=КонецМесяца(Объект.ПериодПланирования);
	ИначеЕсли Объект.Периодичность=Перечисления.Периодичность.Квартал Тогда
		НачПериода=НачалоКвартала(Объект.ПериодПланирования);
		КонПериода=КонецКвартала(Объект.ПериодПланирования);
	ИначеЕсли Объект.Периодичность=Перечисления.Периодичность.Год Тогда
		НачПериода=НачалоГода(Объект.ПериодПланирования);
		КонПериода=КонецГода(Объект.ПериодПланирования);
	Иначе  
		#Если Клиент Тогда
			Сообщить("Неверная периодичность");
		#КонецЕсли
		
		Возврат;
		
	КонецЕсли;
	
	Для Каждого ТекСтр из Объект.Должности Цикл 
		ЗаполнитьДляДолжности(ТекСтр.Должность, КонПериода, ТекСтр.Категория);
	КонецЦикла;
	
	Для Каждого ТекСтр из Было Цикл
		МС=Объект.НаборыKPIДляРасчетаПлана.НайтиСтроки(Новый Структура("Должность, Категория, KPI", ТекСтр.Должность, ТекСтр.Категория, ТекСТр.KPI));
		Если МС.Количество()>0 Тогда
			МС[0].План=ТекСтр.План;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекСтр из БылоБЧ Цикл
		МС=Объект.ПланыБЧ.НайтиСтроки(Новый Структура("Должность, Категория, БазоваяЧасть", ТекСтр.Должность, ТекСтр.Категория, ТекСТр.БазоваяЧасть));
		Если МС.Количество()>0 Тогда
			МС[0].План=ТекСтр.План;
		КонецЕсли;                     
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЕстьНабор(Должность) Экспорт

	Если Объект.Периодичность=Перечисления.Периодичность.Месяц Тогда
		НачПериода=НачалоМесяца(Объект.ПериодПланирования);
		КонПериода=КонецМесяца(Объект.ПериодПланирования);
	ИначеЕсли Объект.Периодичность=Перечисления.Периодичность.Квартал Тогда
		НачПериода=НачалоКвартала(Объект.ПериодПланирования);
		КонПериода=КонецКвартала(Объект.ПериодПланирования);
	ИначеЕсли Объект.Периодичность=Перечисления.Периодичность.Год Тогда
		НачПериода=НачалоГода(Объект.ПериодПланирования);
		КонПериода=КонецГода(Объект.ПериодПланирования);
	Иначе
		Сообщить("Неверная периодичность");
		Возврат	ложь;
	КонецЕсли;
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	СоставKPI.Должность,
	|	СоставKPI.KPI,
	|	СоставKPI.Вес,
	|	СоставKPI.Период КАК Период
	|ИЗ
	|	РегистрСведений.СоставKPI.СрезПоследних(&Дата, ) КАК СоставKPI
	|ГДЕ
	|	СоставKPI.Должность = &Должность
	|	И СоставKPI.Периодичность = &Периодичность
	|	И СоставKPI.ПодразделениеКомпании = &ПодразделениеКомпании
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ");
	Запрос.УстановитьПараметр("Должность", Должность);
	Запрос.УстановитьПараметр("Дата", КонПериода);
	Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
	
	Выб=Запрос.Выполнить().Выбрать();
	
	Если Выб.Следующий() Тогда
		ПослПериод=Выб.Период;
	КонецЕсли;
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	СоставKPI.Должность,
	|	СоставKPI.KPI,
	|	СоставKPI.Вес,
	|	СоставKPI.Период
	|ИЗ
	|	РегистрСведений.СоставKPI.СрезПоследних(&Дата, ) КАК СоставKPI
	|ГДЕ
	|	СоставKPI.Должность = &Должность
	|	И СоставKPI.Периодичность = &Периодичность
	|	И СоставKPI.Период = &Период
	|	И СоставKPI.ПодразделениеКомпании = &ПодразделениеКомпании
	|
	|УПОРЯДОЧИТЬ ПО
	|	СоставKPI.Период УБЫВ");
	
	Запрос.УстановитьПараметр("Должность", Должность);
	Запрос.УстановитьПараметр("Дата", КонПериода);
	Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
	Запрос.УстановитьПараметр("Период", ПослПериод);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
	
	ТК=Запрос.Выполнить().Выгрузить();
	
	Если ТК.Количество()>0 Тогда
		Возврат истина;
	Иначе
		Возврат ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПланыБЧ(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ПодразделениеКомпании) тогда
		Мотивация.СообщитьПользователю("Не заполнено подразделение", "ПодразделениеКомпании");
		Возврат;	
	КонецЕсли;	
	Если Не ЗначениеЗаполнено(Объект.Периодичность) тогда
		Мотивация.СообщитьПользователю("Не заполнена периодичность", "Периодичность");
		Возврат;	
	КонецЕсли;	

	ЗаполнитьПланыБЧНасервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДолжностиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекущаяСтрока = Элементы.Должности.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока = Неопределено
		И ТекущаяСтрока.Должность.КатегорийнаяДолжность 
		И ТекущаяСтрока.Категория = Справочники.КатегорииДолжностей.ПустаяСсылка() Тогда
		
		 УсловноеОформлениеКрасный();
		 
	Иначе
		
		УсловноеОформлениеЧерный();

	КонецЕсли;
	
	ДолжностиПриАктивизацииСтроки(Элемент);
	
КонецПроцедуры

&НаСервере
Процедура УсловноеОформлениеКрасный()
	
	ЭлементУФ = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУФ.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДолжностиКатегория);
	
	ОтборЭлемента = ЭлементУФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Должности.Категория");
	
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;   
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);	

КонецПроцедуры	

&НаСервере
Процедура УсловноеОформлениеЧерный()
	
	ЭлементУФ = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУФ.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДолжностиКатегория);
	
	ОтборЭлемента = ЭлементУФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Должности.Категория");
	
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;   
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Черный);

КонецПроцедуры	

&НаКлиенте
Процедура НаборыKPIДляРасчетаПланаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элементы.Должности.ТекущиеДанные=Неопределено Тогда
		Отказ=истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НаборыKPIДляРасчетаПланаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока тогда
		Элементы.НаборыKPIДляРасчетаПлана.ТекущиеДанные.Должность = Элементы.Должности.ТекущиеДанные.Должность;
		Элементы.НаборыKPIДляРасчетаПлана.ТекущиеДанные.Категория = Элементы.Должности.ТекущиеДанные.Категория;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НаборыKPIДляРасчетаПланаKPIНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Элементы.Должности.ТекущаяСтрока<>Неопределено Тогда
		
		ТекущаяСтрока = Элементы.Должности.ТекущиеДанные;
		
		ТекущаяДолжность = ТекущаяСтрока.Должность;
		ТекущаяКатегория = ТекущаяСтрока.Категория;
		
	КонецЕсли;

	Если Объект.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		
		НачПериода=НачалоМесяца(Объект.ПериодПланирования);
		КонПериода=КонецМесяца(Объект.ПериодПланирования);
		
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		
		НачПериода=НачалоКвартала(Объект.ПериодПланирования);
		КонПериода=КонецКвартала(Объект.ПериодПланирования);
		
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		
		НачПериода=НачалоГода(Объект.ПериодПланирования);
		КонПериода=КонецГода(Объект.ПериодПланирования);
		
	Иначе
		
		Сообщить("Неверная периодичность");
		
		Возврат;
		
	КонецЕсли;
	
	СписокОтбора = ПолучитьСписокДляОтбора(КонПериода);
	
	СтандартнаяОбработка = Ложь;

	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Ссылка", СписокОтбора);
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("Отбор", ПараметрыОтбора);
	ПараметрыВыбора.Вставить("РежимВыбора",Истина);
	ПараметрыВыбора.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыВыбора.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);

	ОткрытьФорму("Справочник.KPI.ФормаСписка",ПараметрыВыбора,Элемент);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокДляОтбора(КонПериода)

	Запрос=Новый Запрос("ВЫБРАТЬ
	|	СоставKPI.Должность,
	|	СоставKPI.Категория,
	|	СоставKPI.KPI,
	|	СоставKPI.Вес,
	|	СоставKPI.Период КАК Период
	|ИЗ
	|	РегистрСведений.СоставKPI.СрезПоследних(&Дата, ) КАК СоставKPI
	|ГДЕ
	|	СоставKPI.Должность = &Должность
	|	И СоставKPI.Категория = &Категория
	|	И СоставKPI.Периодичность = &Периодичность
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ");
	Запрос.УстановитьПараметр("Должность", ТекущаяДолжность);
	Запрос.УстановитьПараметр("Категория", ТекущаяКатегория);
	Запрос.УстановитьПараметр("Дата", КонПериода);
	Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
	
	Выб=Запрос.Выполнить().Выбрать();
	
	Если Выб.Следующий() Тогда
		ПослПериод=Выб.Период;
	КонецЕсли;
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	СоставKPI.Должность,
	|	СоставKPI.Категория,
	|	СоставKPI.KPI,
	|	СоставKPI.Вес,
	|	СоставKPI.Период
	|ИЗ
	|	РегистрСведений.СоставKPI.СрезПоследних(&Дата, ) КАК СоставKPI
	|ГДЕ
	|	СоставKPI.Должность = &Должность
	|	И СоставKPI.Категория = &Категория
	|	И СоставKPI.Периодичность = &Периодичность
	|	И СоставKPI.Период = &Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	СоставKPI.Период УБЫВ");
	Запрос.УстановитьПараметр("Должность", ТекущаяДолжность);
	Запрос.УстановитьПараметр("Категория", ТекущаяКатегория);
	Запрос.УстановитьПараметр("Дата", КонПериода);
	Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
	Запрос.УстановитьПараметр("Период", ПослПериод);
	
	ТЗ=Запрос.Выполнить().Выгрузить();
	
	М=ТЗ.ВыгрузитьКолонку("KPI");
	
	СписокОтбора=Новый СписокЗначений;
	СписокОтбора.ЗагрузитьЗначения(М);

    Возврат СписокОтбора;
	
КонецФункции // ПолучитьСписокДляОтбора()

&НаКлиенте
Процедура ПланыБЧПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элементы.Должности.ТекущиеДанные=Неопределено Тогда
		Отказ=истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПланыБЧПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока тогда
		Элементы.ПланыБЧ.ТекущиеДанные.Должность = Элементы.Должности.ТекущиеДанные.Должность;
		Элементы.ПланыБЧ.ТекущиеДанные.Категория = Элементы.Должности.ТекущиеДанные.Категория;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораИзСпискаПредставленияПериодаРегистрации(ПериодПланирования, СтандартнаяОбработка, ПериодРегистрации, НачальноеЗначение = Неопределено, МинГод=Неопределено) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если НачальноеЗначение = Неопределено Тогда
		НачальноеЗначение = ПериодРегистрации;
	КонецЕсли; 
	
	СписокВыбора = Новый СписокЗначений;
	НачалоТекущегоГода = НачалоГода(НачальноеЗначение);
	НачалоПрошлогоГода = НачалоГода(НачалоТекущегоГода - 1);
	
	Если НЕ МинГод=Неопределено Тогда
		Если НачалоПрошлогоГода<МинГод Тогда
			НачалоПрошлогоГода =МинГод;
		КонецЕсли;
	КонецЕсли;
	
	СписокВыбора.Добавить(НачалоПрошлогоГода, (Формат(НачалоПрошлогоГода, "ДФ='yyyy'") + "..."));
	НачалоМесяцаЗаполнения = НачалоТекущегоГода;
	ЭлементПоУмолчанию = Неопределено;
	Для а = 1 По 12 Цикл
		Если НЕ МинГод=Неопределено Тогда
			
			Если НачалоМесяцазаполнения<МинГод Тогда
				НачалоМесяцаЗаполнения = ДобавитьМесяц(НачалоМесяцаЗаполнения, 1);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		ДобавленныйЭлемент = СписокВыбора.Добавить(НачалоМесяцаЗаполнения, Мотивация.ДатаКакМесяцПредставление(НачалоМесяцаЗаполнения));
		Если НачальноеЗначение = НачалоМесяцаЗаполнения Тогда
			ЭлементПоУмолчанию = ДобавленныйЭлемент;
		КонецЕсли; 
		
		НачалоМесяцаЗаполнения = ДобавитьМесяц(НачалоМесяцаЗаполнения, 1);
	КонецЦикла;
	НачалоСледующегоГода = КонецГода(НачалоТекущегоГода) + 1;
	СписокВыбора.Добавить(НачалоСледующегоГода, (Формат(НачалоСледующегоГода, "ДФ='yyyy'") + "..."));
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ПериодПланирования",ПериодПланирования);
	ДопПараметры.Вставить("МинГод",МинГод);
	ДопПараметры.Вставить("НачальноеЗначение",НачальноеЗначение);
	ДопПараметры.Вставить("СтандартнаяОбработка",СтандартнаяОбработка);
	ДопПараметры.Вставить("ПериодРегистрации",ПериодРегистрации);
	
    ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПериодаРегистрацииНачалоВыбораЗавершение", ЭтотОбъект, ДопПараметры), СписокВыбора, ПериодПланирования);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодаРегистрацииНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	ИначеЕсли Год(ВыбранныйЭлемент.Значение) <> Год(ДополнительныеПараметры.НачальноеЗначение) Тогда
		НачалоВыбораИзСпискаПредставленияПериодаРегистрации(ДополнительныеПараметры.ПериодПланирования, ДополнительныеПараметры.СтандартнаяОбработка, ДополнительныеПараметры.ПериодРегистрации, ВыбранныйЭлемент.Значение, ДополнительныеПараметры.МинГод);
		Возврат;
	КонецЕсли;
	
	Объект.ПериодПланирования = ВыбранныйЭлемент.Значение;
	ДатаПланирования  = Мотивация.ДатаКакМесяцПредставление(Объект.ПериодПланирования);

КонецПроцедуры
